BaseConfiguration/Money_2_0/Documents/РегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РегламентированныйОтчет</Name>
			<Comment>Регламентированный отчет</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчетности</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбраннаяФорма</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
					<Comment>(Общ) Сохраненные данные отчета</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Comment>(Общ) Дата подписи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеревоНастройкиСтраниц</Name>
					<Comment>(Общ) Дерево со списком настроек страниц</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПомощникЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОтчета</Name>
					<Comment>(Общ) Имя встроенной или имя файла внешней обработки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОрганаПосредника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОтчета</Name>
					<Comment>(Общ) Наименование регламентированного отчета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПачки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Comment>(Общ) Периодичность представления отчета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьЕдиницыИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СправочникБанкиБРО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДекларацияСдана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

BaseConfiguration/Money_2_0/CommonModules/ВыделенныйМодульБРО/Ext/Module.bsl
// Возвращается код региона (в соответствии с адресным классификатором) по коду налоговой инспекции.
//
// Параметры:
//	КодНалоговогоОргана - Строка - код налогового органа.
//
// Возвращаемое значение:
//	Строка - код региона по адресному классификатору -  см. РегистрыСведений.АдресныеОбъекты.КлассификаторСубъектовРФ()
//
Функция КодРегионаПоКодуНалоговогоОргана(Знач КодНалоговогоОргана) Экспорт
	
	КодРегиона = "";
	
	Если СтрДлина(КодНалоговогоОргана) < 2 Тогда
		Возврат КодРегиона;	
	КонецЕсли;	
	
	КодРегиона = Лев(КодНалоговогоОргана, 2);
	
	// 99 - код г.Байконур и одновременно код инспекций по крупнейшим налогоплательщикам.
	// 9901 - код местной инспекции, все остальные - инспекции по крупнейшим налогоплательщикам - находятся в Москве
	Если КодРегиона = "99" И КодНалоговогоОргана <> "9901" Тогда
		КодРегиона = "77";
	КонецЕсли;	
		
	Возврат КодРегиона;
	
КонецФункции

// Возвращает таблицу со списком документов уплаты налогов и взносов.
//
// Параметры:
//  Организация	  - СправочникСсылка.Организации - организация-налогоплательщик.
//  НачалоПериода - Дата - начало периода, за который будут отбираться платежи.
//  КонецПериода  - Дата - окончание периода, за который будут отбираться платежи.
//  ПараметрыНалогов - Структура - Параметры налогов, для которых будут отбираться платежи. См.НовыеПараметрыУплатыНалогов()
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица со списком документов оплаты налога.
//
Функция ДокументыУплатыНалогов(Организация, НачалоПериода, КонецПериода, ПараметрыНалогов) Экспорт
	
	ТаблицаДокументов = Новый ТаблицаЗначений();
	ТаблицаДокументов.Колонки.Добавить("Ссылка");
	ТаблицаДокументов.Колонки.Добавить("Дата");
	ТаблицаДокументов.Колонки.Добавить("Номер");
	ТаблицаДокументов.Колонки.Добавить("ВидНалоговогоОбязательства");
	ТаблицаДокументов.Колонки.Добавить("Сумма");
	ТаблицаДокументов.Колонки.Добавить("Оплачено");
	ТаблицаДокументов.Колонки.Добавить("ВидНалога");
	ТаблицаДокументов.Колонки.Добавить("ПоказательПериода");
	ТаблицаДокументов.Колонки.Добавить("ПредставлениеДокумента");
	
	Возврат ТаблицаДокументов;
	
КонецФункции

// Возвращает структуру параметров для передачи в процедуру ДокументыУплатыНалогов
//
Функция НовыеПараметрыУплатыНалогов() Экспорт
	
	ТипПравило = Неопределено;
	
	ПараметрыУплатыНалогов = Новый Структура;
	ПараметрыУплатыНалогов.Вставить("ВидыНалогов",               Новый Массив); // Массив видов налогов.
	ПараметрыУплатыНалогов.Вставить("ВидыНалоговыхОбязательств", Новый Массив); // Массив видов налогов.
	ПараметрыУплатыНалогов.Вставить("Правило",                   ТипПравило);   // Правило, по которому оплачивались налоги и взносы.
	ПараметрыУплатыНалогов.Вставить("КодыЗадач",                 Новый Массив); // Массив кодов задач.
	ПараметрыУплатыНалогов.Вставить("ТипыДокументов",            Новый Массив); // Массив типов платежных документов.
	ПараметрыУплатыНалогов.Вставить("ОтборОплатаЗадолженности",  Неопределено); // По умолчанию отбора нет; если Ложь - только текущие платежи, если Истина - только погашение долга
	
	Возврат ПараметрыУплатыНалогов;
	
КонецФункции

// Устанавливает имя сохраняемого файла.
//
// Параметры:
//  МассивОбъектов - Массив - Массив объектов печати.
//  КоллекцияПечатныхФорм - Массив - Коллекция печатных форм.
//  ОбъектыПечати - Массив - Массив объектов печати.
//  ПараметрыВывода - Структура - Параметры вывода печатной формы.
//
Процедура ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати,
			ПараметрыВывода = Неопределено) Экспорт
	
	Если ТипЗнч(ПараметрыВывода) = Тип("Структура") И ПараметрыВывода.Свойство("НеПереопределятьИмяФайла") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьИмяСохраняемогоФайла(ОбъектыПечати, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Процедура формирует имя сохраняемого файла путем формирования представления документа и удаления из него символов "точка"
Процедура УстановитьИмяСохраняемогоФайла(ОбъектыПечати, КоллекцияПечатныхФорм)
	
	Если НЕ КоллекцияПечатныхФорм.Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ПечатнаяФорма = КоллекцияПечатныхФорм[0];
	Если ЗначениеЗаполнено(ПечатнаяФорма.ИмяФайлаПечатнойФормы) Тогда
		// Имя файла уже задано ранее, не меняем его.
		Возврат;
	КонецЕсли;
	
	ИмяФайлаПечатнойФормы = Новый Соответствие;
	
	Для Каждого ОбъектПечати Из ОбъектыПечати Цикл
		ПредставлениеДокументаДляПечатнойФормы = СформироватьЗаголовокДокумента(
			ОбъектПечати.Значение, ПечатнаяФорма.СинонимМакета);
		ПредставлениеДокументаДляПечатнойФормы = СтрЗаменить(ПредставлениеДокументаДляПечатнойФормы, ".", "");
		ИмяФайлаПечатнойФормы.Вставить(ОбъектПечати.Значение, ПредставлениеДокументаДляПечатнойФормы);
	КонецЦикла;
	
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = ИмяФайлаПечатнойФормы;
	
КонецПроцедуры

// Функция формирует представление заголовка документа.
//
// Возвращаемое значение:
//  Строка - представление номера документа.
//
Функция СформироватьЗаголовокДокумента(ДокументОбъект, НазваниеДокумента = "", ВыводитьИдентификаторГосконтракта = Ложь) Экспорт
	
	Если ДокументОбъект = Неопределено Тогда
		Возврат "";
	Иначе
		
		
		Если ВыводитьИдентификаторГосконтракта И ЗначениеЗаполнено(ДокументОбъект.ГосударственныйКонтракт) Тогда
			ПрефиксНомера = ДокументОбъект.ГосударственныйКонтракт + "/";
		Иначе
			ПрефиксНомера = "";
		КонецЕсли;
		
		Возврат СтрШаблон(
			"%1 № %2 от %3 г.",
			?(НЕ ЗначениеЗаполнено(НазваниеДокумента), ДокументОбъект.Метаданные().Синоним, НазваниеДокумента),
			ПрефиксНомера + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументОбъект.Номер, Истина, Ложь),
			Формат(ДокументОбъект.Дата, "ДФ='дд ММММ гггг'"));
	КонецЕсли;
	
КонецФункции

// Определяет границу периода, в котором отчетность в программе
// не заполняется автоматически, т.к. пользователь не вел учет в программе. Если такой границы нет,
// например, пользователь начал вести учет сразу после того, как зарегистрировался, то возвращается
// Неопределено.
//
// Параметры:
//  Организация	 - СправочникСсылка.Органиации - организация, для которой нужно определить границу.
// 
// Возвращаемое значение:
//   - Дата, Неопределено - граница отчетности прошлых лет. Если отчетности прошлых лет в программе
//                          быть не может, возвращается Неопределено.
//
Функция ГраницаОтчетностиПрошлыхПериодов(Организация) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(РегламентированныйОтчет.ДатаНачала) КАК ДатаНачала
	|ИЗ
	|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	|ГДЕ
	|	РегламентированныйОтчет.Организация = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ДатаНачала) Тогда
		Возврат НачалоГода(Выборка.ДатаНачала);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

	
// Возвращает рассчитанные данные по суммам вычета на детей.
//
// Параметры:
//    СведенияОДетях    - ТаблицаЗначений, СтрокаТаблицыЗначений - Данные о вычетах на детей.
//    РазмерыВычетов    - Структура - Фиксированные значения стандартных вычетов на детей.
//    КоличествоМесяцев - Число - Необязательный. Количество месяцев применения вычета.
//
// Возвращаемое значение:
//   См. НовыйСуммыВычетаНаДетей()
//
Функция РассчитатьСуммыВычетаНаДетей(СведенияОДетях, РазмерыВычетов, КоличествоМесяцев) Экспорт
	
	СуммыВычета = НовыйСуммыВычетаНаДетей();
	
	Для Каждого СтрокаТаблицы Из СведенияОДетях Цикл
		
		Если СтрокаТаблицы.НомерМесяца <= КоличествоМесяцев Тогда
			РассчитатьСуммыВычетаНаДетейПоСтроке(СуммыВычета, СтрокаТаблицы, РазмерыВычетов);
		КонецЕсли;
		
	КонецЦикла;
	
	СуммыВычета.Всего = СуммыВычета.СтандартныйВычет + СуммыВычета.ДвойнойВычет
		+ СуммыВычета.ВычетНаИнвалидов + СуммыВычета.ДвойнойВычетНаИнвалидов;
	
	Возврат СуммыВычета;
	
КонецФункции

Функция НовыйСуммыВычетаНаДетей()
	
	СуммыВычета = Новый Структура;
	СуммыВычета.Вставить("СтандартныйВычет", 0);
	СуммыВычета.Вставить("ДвойнойВычет", 0);
	СуммыВычета.Вставить("ВычетНаИнвалидов", 0);
	СуммыВычета.Вставить("ДвойнойВычетНаИнвалидов", 0);
	СуммыВычета.Вставить("Всего", 0);
	
	Возврат СуммыВычета;
	
КонецФункции

Процедура РассчитатьСуммыВычетаНаДетейПоСтроке(СуммыВычета, СтрокаТаблицы, РазмерыВычетов)
	
	СтандартныйВычет = СтандартныйВычетПоКоличествуДетей(СтрокаТаблицы, РазмерыВычетов);
	ВычетНаИнвалидов = СтрокаТаблицы.РодныеДетиИнвалиды * РазмерыВычетов.РоднойИнвалид
		+ СтрокаТаблицы.ПриемныеДетиИнвалиды * РазмерыВычетов.ПриемныйИнвалид;
	
	Если СтрокаТаблицы.ПрименяетсяДвойнойВычет Тогда
		Коэффициент = 2;
		СуммыВычета.ДвойнойВычет = СуммыВычета.ДвойнойВычет + (СтандартныйВычет * Коэффициент);
		СуммыВычета.ДвойнойВычетНаИнвалидов = СуммыВычета.ДвойнойВычетНаИнвалидов + (ВычетНаИнвалидов * Коэффициент);
	Иначе
		СуммыВычета.СтандартныйВычет = СуммыВычета.СтандартныйВычет + СтандартныйВычет;
		СуммыВычета.ВычетНаИнвалидов = СуммыВычета.ВычетНаИнвалидов + ВычетНаИнвалидов;
	КонецЕсли;
	
КонецПроцедуры

Функция СтандартныйВычетПоКоличествуДетей(ТекущаяСтрока, РазмерыВычетов)
	
	Если ТекущаяСтрока.ВсегоДетей < 3 Тогда
		ДетейДо3 = ТекущаяСтрока.Несовершеннолетних;
	Иначе
		ДетейДо3 = Макс(2 - (ТекущаяСтрока.ВсегоДетей - ТекущаяСтрока.Несовершеннолетних), 0);
	КонецЕсли;
	
	ВычетНаПервого = ?(ДетейДо3 > 0, РазмерыВычетов.ПервыйРебенок, 0);
	ВычетНаВторого = ?(ДетейДо3 > 1, РазмерыВычетов.ВторойРебенок, 0);
	
	ДетейПосле3 = ТекущаяСтрока.Несовершеннолетних - ДетейДо3;
	
	Возврат ВычетНаПервого + ВычетНаВторого + (ДетейПосле3 * РазмерыВычетов.ТретийРебенок);
	
КонецФункции
